# Importing, Reading and Manipulating Data with ACTUAL LITERAL PANDAS

![I have no idea what I'm doing panda](https://cdn-images-1.medium.com/max/1600/1*oBx032ncOwLmCFX3Epo3Zg.jpeg)

Just kidding - but Pandas is a great library to work with relational data.

[Check out the documentation!](https://pandas.pydata.org/pandas-docs/stable/) (always a great idea)

We'll be using the Titanic dataset - you can find this in many places, including [here on Kaggle](https://www.kaggle.com/c/titanic).

In [128]:
# Imports! Can't use pandas unless we bring it into our notebook
import pandas as pd

In [129]:
!ls data/

titanic.csv

In [130]:
# So... how do we access our data?
# I've provided the path - replace None with appropriate code
PATH = "data/titanic.csv"

df = pd.read_csv(PATH)

Let's take a minute to explore that `read_csv` function (and practice reading/exploring documentation): https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html

In [131]:
# Code here to check out the first few rows
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [132]:
# Code here to check the shape of the dataframe
df.shape

(891, 12)

In [133]:
# Code here to check the size of the dataframe
df.size

10692

In [134]:
# Code here to check information on the dataframe
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [135]:
# Code here to check the description of some columns
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [136]:
# Can explore describe further
type(df.Survived.describe())

pandas.core.series.Series

Questions to ask yourself:

- What is this data capturing?
- What can we quickly learn about the data?
- Are there any empty cells? How can I tell?
- What are the datatypes of the data?

**Note:** You see that some of the ways we dealt with our dataframe required `()` and some did not - why is that? 

-

### Exploring our "Target"

In [137]:
# Explore the 'Survived' column
df.Survived.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [138]:
# What are the values of that column?
df.Survived.value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [139]:
df.Survived.unique()

array([0, 1])

In [140]:
# Let's look at the mean of the 'Survived' column
df.Survived.mean()

0.3838383838383838

What does looking at the mean of a boolean column like this actually tell us, in practical terms?

### Subsetting the Data

In [141]:
# Let's explore subsetting the data based on gender 
df.Sex.value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [142]:
# Create a df_female dataframe with all females
df_female = df.loc[df['Sex'] == 'female']
df_female.Sex.unique()

array(['female'], dtype=object)

In [143]:
# Create a df_male dataframe with all males
df_male = df.loc[df['Sex'] == 'male']

In [144]:
# Find the mean of the 'Survived' column for 2 new dfs
print(df_female.Survived.mean())
print(df_male.Survived.mean())

0.7420382165605095
0.18890814558058924

What does this tell us about the diffences between men and women on the Titanic?

 -

Now, we can do the same for age and segment between adults and children (whether they're older or younger than 18) - but, remember, the 'Age' column has `NaN` values:

In [145]:
# Check for nulls in the 'Age' column
df.Age.isnull()

df['Age'].isna().sum()

177

In [146]:
# How many total nulls do we have?
sum(df.Age.isnull())

177

In [147]:
# What percentage of the column is null?
sum(df.Age.isnull())/len(df.Age.isnull())

0.19865319865319866

In [148]:
# What to do with null values?
df = df.dropna(subset = ['Age'])

In [149]:
# Sanity Check! Always worthwhile to check your work to make sure it changed
df.shape
df.Age.isna().sum()
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 714 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    714 non-null int64
Survived       714 non-null int64
Pclass         714 non-null int64
Name           714 non-null object
Sex            714 non-null object
Age            714 non-null float64
SibSp          714 non-null int64
Parch          714 non-null int64
Ticket         714 non-null object
Fare           714 non-null float64
Cabin          185 non-null object
Embarked       712 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 72.5+ KB

You'll see these ages are floats... but why? Aren't they all whole numbers? How can we check?

In [150]:
# Check the age column
df.Age.value_counts()

24.00    30
22.00    27
18.00    26
19.00    25
30.00    25
28.00    25
21.00    24
25.00    23
36.00    22
29.00    20
32.00    18
27.00    18
35.00    18
26.00    18
16.00    17
31.00    17
20.00    15
33.00    15
23.00    15
34.00    15
39.00    14
17.00    13
42.00    13
40.00    13
45.00    12
38.00    11
50.00    10
2.00     10
4.00     10
47.00     9
         ..
71.00     2
59.00     2
63.00     2
0.83      2
30.50     2
70.00     2
57.00     2
0.75      2
13.00     2
10.00     2
64.00     2
40.50     2
32.50     2
45.50     2
20.50     1
24.50     1
0.67      1
14.50     1
0.92      1
74.00     1
34.50     1
80.00     1
12.00     1
36.50     1
53.00     1
55.50     1
70.50     1
66.00     1
23.50     1
0.42      1
Name: Age, Length: 88, dtype: int64

How could we make them integers? Two ways to come to mind - let's explore them, and how they're different.

In [151]:
# Way number 1
df['Age'] = df.Age.map(round)

In [152]:
#Way number 2
df.Age.astype(int)

0      22
1      38
2      26
3      35
4      35
6      54
7       2
8      27
9      14
10      4
11     58
12     20
13     39
14     14
15     55
16      2
18     31
20     35
21     34
22     15
23     28
24      8
25     38
27     19
30     40
33     66
34     28
35     42
37     21
38     18
       ..
856    45
857    51
858    24
860    41
861    21
862    48
864    24
865    42
866    27
867    31
869     4
870    26
871    47
872    33
873    47
874    28
875    15
876    20
877    19
879    56
880    25
881    33
882    22
883    28
884    25
885    39
886    27
887    19
889    26
890    32
Name: Age, Length: 714, dtype: int64

Now let's explore how age affects our target variable:

In [154]:
# Create a df for those younger than 18
df_young = df.loc[df['Age']<18]
df_young.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2,3,1,349909,21.0750,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14,1,0,237736,30.0708,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4,1,1,PP 9549,16.7000,G6,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14,0,0,350406,7.8542,NaN,S
16,17,0,3,"Rice, Master. Eugene",male,2,4,1,382652,29.1250,NaN,Q

In [155]:
# And a df for those 18 or older
df_old = df.loc[df['Age']>=18]

In [158]:
# And let's see how that changes our 'target'
print(df_young.Survived.mean())
print(df_old.Survived.mean())

0.5398230088495575
0.3810316139767055